<?php
//Опрацювати приклад “4.7. Слияние массивов”.
$array1 = array("color" => "red", 2, 4);
$array2 = array("a", "b", "color" => "green", "shape" => "trapezoid", 4);
$result = array_merge($array1, $array2);
// якщо масиви мають однакові строкові ключі, то кожне наступне значення ключа буде перезаписувати минуле(як в нашому випадку з color).
// в результуючому масиві значення з числовими ключами будуть пронумеровані починаючи з 0.


$array3 = array(0 => 'zero_a', 2 => 'two_a', 3 => 'three_a');
$array4 = array(1 => 'one_b', 3 => 'three_b', 4 => 'four_b');
$result2 = $array3 + $array4;
// якщо ми хочемо доповнити перший масив без перезапису значень та без переіндексації, то можемо скористатися оператором +
echo "<pre>";
print_r($result);
print_r($result2);
exit;